<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <title>dev-web-with-me</title>
    <link href="http://devwebwithme.tk/feed.xml" rel="self" />
    <link href="http://devwebwithme.tk" />
    <updated>2017-11-05T09:10:51+07:00</updated>
    <author>
        <name>@dp0613</name>
    </author>
    <id>http://devwebwithme.tk</id>

    <entry>
        <title>Kẻ lười hay anh hùng?</title>
        <author>
            <name>@dp0613</name>
        </author>
        <link href="http://devwebwithme.tk/coder-luoi-hay-anh-hung/"/>
        <id>http://devwebwithme.tk/coder-luoi-hay-anh-hung/</id>
            <category term="Lối sống"/>

        <updated>2017-10-21T18:50:27+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="http://devwebwithme.tk/media/posts/12/22366842_1655193484520203_305659586336407437_n.jpg" alt="" />
                <p class="dropcap">C&oacute; một loại người, khi chạy dự &aacute;n cho kh&aacute;ch thường rất lười, chỉ cần chạy được l&agrave; được. Tui l&agrave; một v&iacute; dụ, nhớ hồi năm 2016, tui c&oacute; tham gia 1 dự &aacute;n l&agrave;m website b&aacute;n h&agrave;ng cho c&ocirc;ng ty "Mars Group", website đ&oacute; hiện nay vẫn c&ograve;n sử dụng v&agrave; lượng kh&aacute;ch h&agrave;ng rất ổn định: <a title="quatangtraotay.com.vn" href="http://quatangtraotay.com.vn" target="_blank" rel="noopener noreferrer">quatangtraotay.com.vn</a>.</p>
<h3>Kỉ niệm của tui</h3>
<p>Trong dự &aacute;n đ&oacute;, c&oacute; 1 module l&agrave; thống k&ecirc; truy cập, module n&agrave;y sẽ hiện ra c&oacute; bao nhi&ecirc;u người đ&atilde; truy cập, bao nhi&ecirc;u người đang trực tuyến... ở ch&acirc;n website (footer). Hồi đ&oacute;, do deadline đến nơi m&agrave; vẫn chưa xong n&ecirc;n module đ&oacute; tui dev rất <span style="text-decoration: line-through;">nhanh</span> ẩu (kh&ocirc;ng th&igrave; n&aacute;t ass). N&oacute; sinh ra 1 c&aacute;i bug l&agrave; lượt truy cập v&agrave; lượng trực tuyến sai. Nhưng m&agrave; tui vẫn giao cho kh&aacute;ch v&agrave; kh&aacute;ch đồng &yacute;, đơn giản v&igrave; con số đ&oacute; sai nhưng l&agrave; số ảo v&agrave; lớn. Cho n&ecirc;n khiến cho kh&aacute;ch h&agrave;ng của <strong>quatangtraotay</strong> nghĩ rằng đang c&oacute; rất nhiều người sử dụng (c&aacute;i n&agrave;y gọi l&agrave; g&atilde;i v&agrave;o chỗ ngứa kh&aacute;ch h&agrave;ng - biến bug th&agrave;nh feature). Đến b&acirc;y giờ c&aacute;i bug n&agrave;y vẫn giữ nguy&ecirc;n như vậy, kh&ocirc;ng sửa chữa g&igrave; cả, v&igrave; tui đ&atilde; nghỉ l&agrave;m ở c&ocirc;ng ty n&agrave;y rồi (ở nh&agrave; cho con b&uacute;).</p>
<blockquote>Kẻ lười lu&ocirc;n t&igrave;m c&aacute;ch để giải quyết mọi việc một c&aacute;ch hiệu quả nhất</blockquote>
<h4>Th&uacute; tội</h4>
<p>Nếu bạn nghĩ tui đang ca ngợi những kẻ lười th&igrave; bạn đ&atilde; qu&aacute; ATSM rồi. Thật ra m&agrave; n&oacute;i, kể cho c&aacute;c bạn nghe về quatangtraotay l&agrave; 1 c&aacute;ch để tui th&uacute; tội.&nbsp;</p>
<p>Cuộc đời n&agrave;y đ&atilde; qu&aacute; kh&oacute; khăn rồi, đừng l&agrave;m cho n&oacute; th&ecirc;m kh&oacute; sống. Bạn biết kh&ocirc;ng, chỉ v&igrave; muốn tiết kiệm v&agrave;i giờ l&agrave;m việc, hay đơn giản v&igrave; bạn thấy n&oacute; kh&ocirc;ng quan trọng m&agrave; đ&ocirc;i khi, người đến sau sẽ phải mất cả tuần d&agrave;i để giải quyết đống hỗn loạn m&agrave; bạn để lại. Chuyện đ&oacute; xảy ra khi m&agrave; v&agrave;o một ng&agrave;y đầy nắng, Mars Group muốn n&acirc;ng cấp website. Thế l&agrave; kẻ đến sau xuất hiện (ơn giời cậu đ&acirc;y rồi), rồi đ&acirc;y cuộc đời sẽ bế tắc hay nở hoa? Tui đo&aacute;n l&agrave; &iacute;t nhất kh&ocirc;ng bế tắc th&igrave; cũng đắng l&ograve;ng. V&igrave; sao ư, họ sẽ fix lại c&aacute;i bug thống k&ecirc; truy cập, nhưng khi fix xong th&igrave; Mars Group kh&ocirc;ng chấp nhận, v&igrave; số lượng truy cập sau khi fix bị giảm đi (do của tui l&agrave;m l&agrave; số ảo m&agrave;)... v&agrave; rồi, sự thương lượng, những ng&agrave;y d&agrave;i thu thập feedback lại diễn ra...&nbsp;</p>
<p>C&aacute;i t&iacute;nh lười n&agrave;y, bạn nhất định phải diệt n&oacute; tận gốc. Để trong suy nghĩ th&igrave; n&oacute; l&agrave;m hư suy nghĩ, đặt trong c&ocirc;ng việc th&igrave; n&oacute; l&agrave;m mất đi uy t&iacute;n, v&agrave; h&agrave;ng ng&agrave;n c&aacute;i hậu quả kh&aacute;c. Bạn nghĩ sao, nếu bạn tham gia ph&aacute;t triển driver cho m&aacute;y thở oxy trong bệnh viện? Liệu c&aacute;i t&iacute;nh lười đ&oacute; c&oacute; gi&uacute;p m&aacute;y oxy của bạn cứu người hay đang thở th&igrave; sinh bug (ặc ặc).</p>
<p>Đừng bao giờ suy nghĩ, c&aacute;i chương tr&igrave;nh chứa bug của bạn sẽ cứu thế giới khi AI l&ecirc;n nắm quyền. V&igrave; theo tui&nbsp;nghề n&agrave;o cũng c&oacute; đạo đức của nghề đ&oacute;. Nghề y c&oacute; y đức, th&igrave; coder c&oacute; "code đức". Bạn kh&ocirc;ng thể giỏi l&ecirc;n nếu m&atilde;i lười như vậy. Nếu kh&ocirc;ng chạy kịp deadline th&igrave; xin th&ecirc;m v&agrave;i ng&agrave;y. Nếu kh&ocirc;ng sửa được bug th&igrave; t&igrave;m người gi&uacute;p đỡ. Nếu muốn hết lười th&igrave; phải lấy đức l&agrave;m đầu.</p>
<p>Từng d&ograve;ng code bạn viết ra, ch&iacute;nh l&agrave; con người của bạn. H&atilde;y chăm ch&uacute;t cho n&oacute;, ho&agrave;n thiện n&oacute;. Một ng&agrave;y kh&ocirc;ng xa, rồi bạn sẽ được 1 slot tham gia team <strong><em>cứu thế giới</em></strong> m&agrave; th&ocirc;i.</p>
<h3>C&ograve;n g&igrave; nữa?</h3>
<p>Nếu bạn c&oacute; kỉ niệm n&agrave;o như tui ở tr&ecirc;n th&igrave; chia sẻ cho anh em nh&eacute;. H&atilde;y th&uacute; tội v&agrave; sửa lỗi - đ&oacute; mới l&agrave; anh h&ugrave;ng thật sự, bằng kh&ocirc;ng bạn chỉ l&agrave; 1 kẻ lười kh&ocirc;ng hơn kh&ocirc;ng k&eacute;m.</p>
<p>&nbsp;</p>
            ]]>
        </content>
    </entry>
    <entry>
        <title>Giữ lại code cũ - tình yêu hay dại khờ?</title>
        <author>
            <name>@dp0613</name>
        </author>
        <link href="http://devwebwithme.tk/nen-hay-khong-ghi-chu-code-khong-dung/"/>
        <id>http://devwebwithme.tk/nen-hay-khong-ghi-chu-code-khong-dung/</id>
            <category term="Kinh nghiệm"/>

        <updated>2017-11-05T09:10:14+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="http://devwebwithme.tk/media/posts/11/0a23b0fe314f82e9d8760c95104ddffe331551ef.jpg" alt="" />
                <h3>Chuyện ba ng&agrave;y mưa</h3>
<p>Mấy ng&agrave;y nay tui bị sa v&agrave;o chiến trường NodeJS v&agrave; AngularJS... Chẳng l&agrave; đang tham gia v&agrave;o một dự &aacute;n outsource cho 1 c&ocirc;ng ty của nước ngo&agrave;i (h&igrave;nh như l&agrave; Mỹ).</p>
<p>C&ocirc;ng việc l&agrave; l&agrave;m lại hệ thống sẵn c&oacute; của họ, hay n&oacute;i thẳng ra l&agrave; "tạo ra bug mới tr&ecirc;n bug cũ...", hệ thống d&ugrave;ng AngularJS, SASS, Jade để l&agrave;m frontend. NodeJS, Laravel v&agrave; Postgres để xử l&yacute; API (nghe th&ocirc;i &nbsp;l&agrave; muốn&nbsp;<span style="text-decoration: line-through;">tuột quần</span> t&eacute; xỉu).</p>
<figure class="post__image post__image--center" contenteditable="false"><img src="http://devwebwithme.tk/media/posts/11/22550388_1657047427668142_4685091446118958224_o.jpg" width="829" height="1206">
<figcaption contenteditable="true">Giữ lại code cũ, t&igrave;nh y&ecirc;u hay dại khờ?</figcaption>
</figure>
<h3>Khi n&agrave;o?</h3>
<p>Việc giữ lại code cũ l&agrave; việc thường xuy&ecirc;n xảy ra ở những c&ocirc;ng ty startup. C&aacute;c ng&agrave;i ấy lu&ocirc;n phải đưa ra quyết định, đặc biệt l&agrave; v&agrave;o những l&uacute;c sau:</p>
<ul>
<li>Sản phẩm v1.0 bị failed</li>
<li>Hệ thống kh&ocirc;ng đ&aacute;p ứng được lượng người d&ugrave;ng ng&agrave;y c&agrave;ng tăng (tin vui hay buồn?)</li>
<li>Nh&acirc;n sự gốc ra đi, để lại 1 hệ thống kh&ocirc;ng c&oacute; document.</li>
<li>Hay đơn giản l&agrave; hệ thống cũ vẫn okie, chỉ c&oacute; điều code ngu qu&aacute; n&ecirc;n kh&oacute; maintain.</li>
</ul>
<h3>V&agrave; tại sao?</h3>
<p>Ai l&agrave;m startup rồi cũng sẽ gặp &iacute;t nhất l&agrave; 1 ho&agrave;n cảnh giống như tui viết ở tr&ecirc;n. L&yacute; do m&agrave; startup hay quyết định giữ lại code cũ thay v&igrave; l&agrave;m mới l&agrave; v&igrave;:</p>
<ul>
<li><strong>Chi ph&iacute;:</strong> Nếu l&agrave;m lại mới, sẽ tốn rất nhiều tiền cho c&aacute;c c&ocirc;ng ty outsource hoặc cho nh&acirc;n lực.</li>
<li><strong>Thời gian:</strong>&nbsp;Mất nhiều thời gian để tạo ra 1 hệ thống đẹp (l&agrave;m lại m&agrave; l&agrave;m xấu th&igrave; giữ c&aacute;i cũ cho rồi)</li>
<li><strong>Nh&acirc;n lực:</strong> Hạn chế về tr&igrave;nh độ (startup thường l&agrave; dồi d&agrave;o &yacute; tưởng, chứ chưa đủ kỹ năng v&agrave; tr&igrave;nh độ). V&agrave; hay gặp nhất l&agrave; kh&ocirc;ng đủ người: vừa quản trị c&aacute;i cũ vừa ph&aacute;t triển c&aacute;i mới.</li>
<li>Do c&oacute; t&igrave;nh cảm s&acirc;u nặng với hệ thống cũ (thật đ&oacute; kh&ocirc;ng đ&ugrave;a đ&acirc;u)</li>
<li>V&agrave; h&agrave;ng tỷ l&yacute; do kh&aacute;c t&ugrave;y theo cảm x&uacute;c c&aacute; nh&acirc;n của ng&agrave;i ấy (500 sắc th&aacute;i)</li>
</ul>
<p>Cho n&ecirc;n l&agrave; <strong>giữ lại c&aacute;i cũ</strong>...</p>
<h3>T&igrave;nh y&ecirc;u hay dại khờ?</h3>
<p>Thật ra m&agrave; n&oacute;i, khi y&ecirc;u l&agrave; đ&atilde; dại khờ... &agrave; nhầm, đang viết về startup...</p>
<p>Tui kh&ocirc;ng ph&acirc;n t&iacute;ch việc giữ lại hệ thống cũ l&agrave; đ&uacute;ng hay sai. Thay v&agrave;o đ&oacute; tui sẽ chỉ ra 1 v&agrave;i hướng kh&aacute;c vẹn cả đ&ocirc;i đường. Để l&agrave;m được điều đ&oacute;, c&aacute;c bạn phải tạo ra một hệ thống ho&agrave;n to&agrave;n mới, v&agrave; hệ thống mới n&agrave;y sẽ được lắp gh&eacute;p từ những module.</p>
<p>Module của hệ thống mới được x&aacute;c định dựa v&agrave;o hệ thống cũ. Module đăng k&yacute; - đăng nhập l&agrave; 1 v&iacute; dụ. Bạn sẽ tạo ra UI mới cho module n&agrave;y, sau đ&oacute; viết 1 API gi&uacute;p hệ thống mới d&ugrave;ng database cũ. V&agrave; thậm ch&iacute; c&oacute; thể viết th&ecirc;m API d&ugrave;ng ri&ecirc;ng cho database mới.</p>
<p>Như vậy c&aacute;c bạn thấy mấu chốt ở đ&acirc;y ch&iacute;nh l&agrave; API v&agrave; c&aacute;ch n&acirc;ng cấp từng module. Hệ thống cũ vẫn duy tr&igrave; hoạt động, v&agrave; sẽ được n&acirc;ng cấp từng ng&agrave;y qua từng module. C&aacute;ch l&agrave;m n&agrave;y sẽ hạn chế tối đa c&aacute;c vấn đề về thời gian, nh&acirc;n lực v&agrave; chi ph&iacute;.&nbsp;</p>
<h3>B&agrave;i viết n&agrave;y c&oacute; gi&uacute;p tui t&igrave;m được việc l&agrave;m?</h3>
<p>Phạm vi của b&agrave;i viết l&agrave; n&oacute;i kh&aacute; chung chung về 1 vấn đề m&agrave; startup hay gặp, c&ograve;n chuyện bạn t&igrave;m được việc l&agrave;m hay kh&ocirc;ng th&igrave; h&atilde;y để lại feedback b&ecirc;n dưới cho tui biết nh&eacute;.&nbsp;</p>
<p>Bạn c&oacute; nghĩ việc chia module l&agrave; hợp l&yacute;?</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
            ]]>
        </content>
    </entry>
    <entry>
        <title>Gửi Liên Minh</title>
        <author>
            <name>@dp0613</name>
        </author>
        <link href="http://devwebwithme.tk/gui-lien-minh/"/>
        <id>http://devwebwithme.tk/gui-lien-minh/</id>
            <category term="Lối sống"/>

        <updated>2017-10-13T22:54:54+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="http://devwebwithme.tk/media/posts/10/happy-doraemon-desktop-background.jpg" alt="" />
                Gửi con trai của ba...<br><br>H&ocirc;m nay l&agrave; thứ 6 ng&agrave;y 13 th&aacute;ng 10 năm 2017, cuối c&ugrave;ng th&igrave; dp0613 (ba của con đ&oacute;) cũng đ&atilde; trở th&agrave;nh cha. Con biết g&igrave; kh&ocirc;ng, ba lấy biệt danh l&agrave; dp0613 v&igrave; 24 năm cuộc đời ba l&uacute;c n&agrave;o cũng xui xẻo, ng&agrave;y n&agrave;o cũng l&agrave; thứ 6 ng&agrave;y 13 cả.<br><br>Nhưng m&agrave; h&ocirc;m nay, cũng thứ 6 ng&agrave;y 13 - ng&agrave;y may mắn v&agrave; hạnh ph&uacute;c nhất trong suốt 24 năm nay.<br><br>Ba kh&ocirc;ng n&oacute;i h&ocirc;m nay l&agrave; ng&agrave;y hạnh ph&uacute;c nhất đời ba, v&igrave; ba biết, khi c&oacute; con b&ecirc;n cạnh ba mẹ, mỗi ng&agrave;y tr&ocirc;i qua đều sẽ l&agrave; ng&agrave;y hạnh ph&uacute;c.<br><br>Ai rồi cũng t&igrave;m thấy hạnh ph&uacute;c cho ri&ecirc;ng m&igrave;nh phải kh&ocirc;ng con! Sau bao nhi&ecirc;u năm kiếm t&igrave;m, ba đ&atilde; t&igrave;m thấy tr&aacute;n nhỏ (l&agrave; mẹ con đ&oacute;) rồi ch&iacute;nh người phụ nữ tuyệt vời ấy đ&atilde; cho ba một thi&ecirc;n chức: L&agrave;m cha!<br><br>Ba mẹ hi vọng, Mon của ba sẽ l&agrave; một người đ&agrave;n &ocirc;ng ch&iacute;nh trực, y&ecirc;u thương mọi người. Ba mẹ kh&ocirc;ng mong sau n&agrave;y con gi&agrave;u c&oacute; về tiền bạc, m&agrave; h&atilde;y gi&agrave;u c&oacute; về t&igrave;nh y&ecirc;u thương con nh&eacute;. V&igrave; con biết kh&ocirc;ng, ch&iacute;nh t&igrave;nh y&ecirc;u thương đ&atilde; cho ba gặp mẹ con, v&agrave; cũng ch&iacute;nh nhờ n&oacute; m&agrave; con được sinh ra, được sống, được y&ecirc;u thương.<br><br>Mon h&atilde;y sống giản dị v&agrave; b&igrave;nh y&ecirc;n. Từ khi mang thai Mon, mẹ tr&aacute;n nhỏ chưa từng bị h&agrave;nh như bao b&agrave; bầu kh&aacute;c, đến khi sắp sinh cũng chỉ hơi nặng bụng. Ba lu&ocirc;n c&oacute; linh cảm con l&agrave; đứa con tốt, thương ba mẹ rất nhiều !<br><br>V&agrave; nếu, một ng&agrave;y n&agrave;o đ&oacute;, Mon đọc được những d&ograve;ng n&agrave;y, th&igrave; con h&atilde;y nhớ, ba mẹ vẫn m&atilde;i y&ecirc;u thương Mon...<br><br>Ba mẹ y&ecirc;u con - Trần T&ocirc; Li&ecirc;n Minh (Mon)!!<br><br>Ba của con.
            ]]>
        </content>
    </entry>
    <entry>
        <title>Vagrant - người thay thế hoàn hảo cho XAMPP và WAMP</title>
        <author>
            <name>@dp0613</name>
        </author>
        <link href="http://devwebwithme.tk/vagrant-ngay-thay-the-hoan-hao-cho-xampp-va-wamp/"/>
        <id>http://devwebwithme.tk/vagrant-ngay-thay-the-hoan-hao-cho-xampp-va-wamp/</id>
            <category term="Hướng dẫn"/>

        <updated>2017-10-11T17:53:53+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="http://devwebwithme.tk/media/posts/8/vagrant-with-symfony2.jpg" alt="" />
                <h3>C&oacute; 2 loại người:</h3>
<figure class="post__image post__image--center" contenteditable="false"><img src="http://devwebwithme.tk/media/posts/8/wampxampp.jpg" alt="Bạn y&ecirc;u m&agrave;u cam năng động hay th&iacute;ch m&agrave;u hồng nữ t&iacute;nh?" width="615" height="200">
<figcaption contenteditable="true">Bạn th&iacute;ch m&agrave;u cam trẻ trung hay y&ecirc;u m&agrave;u hồng nữ t&iacute;nh? (H&igrave;nh ảnh từ Google)</figcaption>
</figure>
<p>Nếu bạn nhận ra v&agrave; hiểu h&igrave;nh ảnh ph&iacute;a tr&ecirc;n th&igrave; bạn đ&uacute;ng l&agrave; 1 tay "code web ki&ecirc;m c&agrave;i win dạo" chuy&ecirc;n nghiệp.</p>
<p>Tui c&oacute; quen kh&aacute; nhiều bạn c&ugrave;ng l&agrave; d&acirc;n l&agrave;m web. V&agrave; ngay cả tui hồi đ&oacute; cũng chỉ sử dụng Wamp hay Xampp m&agrave; th&ocirc;i. T&igrave;nh y&ecirc;u d&agrave;nh cho "kh&uacute;c xương cam" v&agrave; c&aacute;i "bồ c&agrave;o hồng" vẫn lu&ocirc;n vẹn nguy&ecirc;n cho đến ng&agrave;y nay, &agrave; đ&uacute;ng hơn l&agrave; tối h&ocirc;m qua.&nbsp;</p>
<p>Chuyện l&agrave; tối h&ocirc;m qua khi đang m&ograve; c&aacute;ch c&agrave;i nhiều phi&ecirc;n bản php v&agrave;o 1 server để ng&acirc;m cứu th&igrave; tui v&ocirc; t&igrave;nh bắt gặp <strong>vagrant</strong> - người t&igrave;nh s&eacute;t đ&aacute;nh - mới gặp đ&atilde; y&ecirc;u.</p>
<h3>Vagrant - kẻ đến sau hay người thay thế?</h3>
<p>Wamp v&agrave; Xampp d&ugrave;ng để l&agrave;m g&igrave; v&agrave; d&ugrave;ng như thế n&agrave;o tui sẽ kh&ocirc;ng đề cập tới nữa.&nbsp;V&igrave; khi đ&atilde; đọc tới đ&acirc;y nghĩa l&agrave; bạn biết cả rồi.</p>
<p>Về người đến sau vagrant, n&oacute; cũng l&agrave; 1 server ảo. Tuy nhi&ecirc;n c&aacute;i m&agrave; vagrant d&agrave;nh tặng cho bạn kh&ocirc;ng phải chỉ l&agrave; 1 server, đ&oacute; l&agrave; m&aacute;y chủ c&agrave;i hệ điều h&agrave;nh thật sự. Bạn c&oacute; thể tự chọn hệ điều h&agrave;nh, d&ugrave; l&agrave; Linux v&agrave; d&ograve;ng họ của n&oacute; hay l&agrave; MacOS, Windows đều được. V&agrave; sau đ&oacute; bạn c&oacute; thể tự do c&agrave;i đặt c&aacute;c phần mềm cần d&ugrave;ng cho m&aacute;y chủ n&agrave;y.</p>
<p>Vagrant c&oacute; thể d&ugrave;ng để:</p>
<ul>
<li>L&agrave;m m&aacute;y chủ để ph&aacute;t triển web</li>
<li>L&agrave;m m&aacute;y chủ để học hệ điều h&agrave;nh, chẳng hạn mấy bạn chuy&ecirc;n về mạng phải học Linux</li>
<li>D&ugrave;ng để thử nghiệm v&agrave; n&acirc;ng cấp web: V&iacute; dụ bạn c&oacute; c&aacute;i web sử dụng PHP 5, b&acirc;y giờ muốn n&acirc;ng cấp n&oacute; l&ecirc;n PHP 7 th&igrave; phải c&oacute; 1 m&aacute;y chủ c&agrave;i được cả 2 phi&ecirc;n bản PHP.</li>
</ul>
<p><strong>V&agrave; c&ograve;n nhiều c&aacute;ch d&ugrave;ng Vagrant kh&aacute;c, n&oacute;i chung l&agrave; n&oacute; c&oacute; thể thay thế ho&agrave;n to&agrave;n Wamp v&agrave; Xampp.</strong></p>
<p>Đọc th&ecirc;m giới thiệu về Vagrant:&nbsp;<a href="https://www.vagrantup.com/intro/index.html">https://www.vagrantup.com/intro/index.html</a></p>
<h3>C&agrave;i đặt</h3>
<p>Để c&oacute; thể l&agrave;m việc với Vagrant, đầu ti&ecirc;n c&aacute;c bạn phải tải c&aacute;c phần mềm b&ecirc;n dưới:</p>
<ul>
<li><a title="Tải VirtualBox" href="https://www.virtualbox.org/wiki/Downloads" target="_blank" rel="noopener noreferrer">VirtualBox</a>:&nbsp;L&agrave; bộ thư viện gi&uacute;p tạo lập m&aacute;y ảo ngay trong hệ điều h&agrave;nh đang sử dụng. Bạn cần tải đ&uacute;ng với hệ điều h&agrave;nh m&agrave; bạn đang sử dụng nh&eacute;.</li>
<li><a title="Tải Vagrant" href="https://releases.hashicorp.com/vagrant/1.9.5/" target="_blank" rel="noopener noreferrer">Vagrant</a>: Đ&acirc;y l&agrave; người thay thế của ch&uacute;ng ta. Bạn ch&uacute; &yacute; n&ecirc;n tải phi&ecirc;n bản <code>1.9.5</code> nh&eacute;, phi&ecirc;n bản mới nhất hiện đang c&oacute; 1 số lỗi.&nbsp;</li>
<li><a title="Cmder" href="http://cmder.net/" target="_blank" rel="noopener noreferrer">Cmder</a>: L&agrave; 1 phần mềm thay thế cmd của hệ thống, n&oacute; dễ x&agrave;i v&agrave; đẹp hơn :p&nbsp;</li>
</ul>
<p>Sau khi c&agrave;i đặt xong 3 phần mềm tr&ecirc;n, bạn phải khởi động lại m&aacute;y.</p>
<h3>Kh&aacute;i niệm cơ bản</h3>
<p>Trước khi c&oacute; thể l&agrave;m việc với Vagrant, bạn cần nắm được 1 số kh&aacute;i niệm cơ bản li&ecirc;n quan:</p>
<p><strong>Vagrantfile</strong></p>
<p>Đ&acirc;y l&agrave; t&ecirc;n 1 tệp nằm ở ngo&agrave;i c&ugrave;ng của thư mục chứa Vagrant. T&aacute;c dụng quan trọng nhất của n&oacute; l&agrave; cho vagrant biết n&oacute; sẽ sử dụng loại m&aacute;y chủ n&agrave;o (hay n&oacute; đ&uacute;ng hơn l&agrave; <code>box</code> n&agrave;o). Ngo&agrave;i ra n&oacute; c&ograve;n chứa c&aacute;c thiết lập về IP v&agrave; tham số bộ nhớ...</p>
<p><strong>Box</strong></p>
<p>Vagrant cho ph&eacute;p bạn c&agrave;i rất nhiều hệ điều h&agrave;nh, v&agrave; c&aacute;c tập tin chứa c&aacute;c hệ điều h&agrave;nh đ&oacute; gọi l&agrave; <code>box</code>. Mỗi box l&agrave; 1 hệ điều h&agrave;nh (hoặc 1 thư viện c&agrave;i sẵn c&aacute;c phần mềm li&ecirc;n quan).&nbsp;</p>
<p>Muốn xem danh s&aacute;ch c&aacute;c <code>box</code> của vagrant th&igrave; <a href="https://app.vagrantup.com/boxes/search?_ga=2.126578382.2109020178.1507566131-1033133917.1507566131" target="_blank" rel="noopener noreferrer">v&agrave;o đ&acirc;y</a>.</p>
<p>Khi bạn muốn khởi động hoặc tạo mới 1 m&aacute;y chủ, bạn cần <code>add</code> box v&agrave;o vagrant. Nếu <code>box</code> đ&atilde; c&oacute; sẵn, bạn cần phải cấu h&igrave;nh t&ecirc;n <code>box</code> ở file <code>Vagrantfile</code>.&nbsp;</p>
<p>C&aacute;ch l&agrave;m như thế n&agrave;o sẽ n&oacute;i r&otilde; ở phần b&ecirc;n dưới.</p>
<p><strong>Synced Folders</strong></p>
<p>Kh&aacute;i niệm n&agrave;y n&oacute;i đến việc c&aacute;c tập tin nằm trong thư mục chứa tệp <code>Vagrantfile</code> được đồng bộ với m&aacute;y chủ ảo lu&ocirc;n. M&agrave; cụ thể l&agrave; n&oacute; được đồng bộ với thư mục <code>/vagrant</code> ở m&aacute;y ảo.</p>
<h3>Tạo m&aacute;y chủ mới</h3>
<p>Đọc kh&aacute;i niệm thấy mơ hồ đ&uacute;ng kh&ocirc;ng. Kh&ocirc;ng sao, dưới đ&acirc;y, tui sẽ hướng dẫn c&aacute;c bạn c&agrave;i đặt Vagrant tr&ecirc;n windows, c&aacute;c hệ điều h&agrave;nh kh&aacute;c cũng y hệt th&ocirc;i.</p>
<p><em><strong>Bước 1: Tạo thư mục mới chứa vagrant</strong></em></p>
<p>Tui sẽ tạo 1 thư mục mới c&oacute; t&ecirc;n l&agrave; <code>D:/vagrant</code> ở ổ đĩa D, như h&igrave;nh b&ecirc;n dưới:</p>
<figure class="post__image post__image--center" contenteditable="false"><img src="http://devwebwithme.tk/media/posts/8/untitled.png" alt="Tạo thư mục mới chứa Vagrant" width="214" height="254">
<figcaption contenteditable="true">Tạo thư mục mới chứa Vagrant (Đừng hỏi t&ecirc;n c&aacute;c thư mục bị che)</figcaption>
</figure>
<p><strong><em>Bước 2: Th&ecirc;m box v&agrave;o vagrant</em></strong></p>
<p>T&ocirc;i khuy&ecirc;n c&aacute;c bạn n&ecirc;n sử dụng <code>box</code> <code>ubuntu/trusty64</code> hoặc <code>ubuntu/trusty32</code> nh&eacute;. V&igrave; 2 box n&agrave;y sẽ hỗ trợ PHP 7 cho c&aacute;c bạn thoải m&aacute;i sử dụng hơn. C&ograve;n kh&ocirc;ng th&iacute;ch th&igrave; c&oacute; thể l&ecirc;n trang xem <code>box</code> ở phần tr&ecirc;n m&agrave; chọn.</p>
<p>Bạn mở <strong>Cmder</strong> mới c&agrave;i ở phần đầu l&ecirc;n nh&eacute;. V&agrave; g&otilde; v&agrave;o như sau:</p>
<pre><code class="language-vim">$ D:                                 #V&agrave;o ổ đĩa D

$ cd vagrant                         #V&agrave;o thư mục vagrant

$ vagrant box add ubuntu/trusty32    #Thay thế ubuntu/trusty32 t&ecirc;n box theo &yacute; bạn nh&eacute;</code></pre>
<p><em><strong>Bước 3: Khởi tạo v&agrave; cấu h&igrave;nh <code>Vagrantfile</code></strong></em></p>
<pre><code class="language-vim">$ vagrant init          #Khởi tạo, xong sẽ c&oacute; 1 tệp t&ecirc;n Vagrantfile nằm trong thư mục vagrant</code></pre>
<p>Sau khi khởi tạo, ch&uacute;ng ta sẽ cấu h&igrave;nh tệp <code>Vagrantfile</code>, dưới đ&acirc;y sẽ l&agrave; c&aacute;c chỗ c&aacute;c bạn cần sửa, l&agrave;m theo cho kỹ nh&eacute;:</p>
<pre><code class="language-vim">#Thay thế bằng t&ecirc;n box bạn sử dụng
config.vm.box = "ubuntu/trusty32" 

#Bỏ dấu # 
config.vm.network "forwarded_port", guest: 80, host: 8080 

#Bỏ dấu #, đổi th&agrave;nh IP 55.55.55.5 cho dễ nhớ
config.vm.network "private_network", ip: "55.55.55.5" 

#Bỏ dấu # v&agrave; sửa lại giống tui (M&aacute;y thật -&gt; m&aacute;y ảo)
config.vm.synced_folder "D:\\vagrant\\", "/vagrant" 


#Bỏ dấu # ở d&ograve;ng đầu v&agrave; chỗ chữ end. Th&ecirc;m v&agrave;o 3 d&ograve;ng customize

config.vm.provider "virtualbox" do |vb|

  vb.customize ["setextradata", :id, "VBoxInternal2/SharedFoldersEnableSymlinksCreate/htdocs", "1"]

  vb.customize ["modifyvm", :id, "--nictype1", "Am79C973"]
 
  vb.customize ["modifyvm", :id, "--nictype2", "Am79C973"]
 end

# Th&ecirc;m d&ograve;ng n&agrave;y v&agrave;o cuối file (đặt trước chữ end)
config.vm.boot_timeout = 600
</code></pre>
<p>&nbsp;Tệp <code>Vagrantfile</code> đầy đủ:</p>
<pre><code class="language-vim">
# -*- mode: ruby -*-
# vi: set ft=ruby :

# All Vagrant configuration is done below. The "2" in Vagrant.configure
# configures the configuration version (we support older styles for
# backwards compatibility). Please don't change it unless you know what
# you're doing.
Vagrant.configure("2") do |config|
  # The most common configuration options are documented and commented below.
  # For a complete reference, please see the online documentation at
  # https://docs.vagrantup.com.

  # Every Vagrant development environment requires a box. You can search for
  # boxes at https://atlas.hashicorp.com/search.
  config.vm.box = "ubuntu/trusty32"

  # Disable automatic box update checking. If you disable this, then
  # boxes will only be checked for updates when the user runs
  # `vagrant box outdated`. This is not recommended.
  # config.vm.box_check_update = false

  # Create a forwarded port mapping which allows access to a specific port
  # within the machine from a port on the host machine. In the example below,
  # accessing "localhost:8080" will access port 80 on the guest machine.
  # NOTE: This will enable public access to the opened port
   config.vm.network "forwarded_port", guest: 80, host: 8080

  # Create a forwarded port mapping which allows access to a specific port
  # within the machine from a port on the host machine and only allow access
  # via 127.0.0.1 to disable public access
  # config.vm.network "forwarded_port", guest: 80, host: 8080, host_ip: "127.0.0.1"

  # Create a private network, which allows host-only access to the machine
  # using a specific IP.
   config.vm.network "private_network", ip: "55.55.55.5"

  # Create a public network, which generally matched to bridged network.
  # Bridged networks make the machine appear as another physical device on
  # your network.
  # config.vm.network "public_network"

  # Share an additional folder to the guest VM. The first argument is
  # the path on the host to the actual folder. The second argument is
  # the path on the guest to mount the folder. And the optional third
  # argument is a set of non-required options.
  config.vm.synced_folder "D:\\vagrant\\", "/vagrant"

  # Provider-specific configuration so you can fine-tune various
  # backing providers for Vagrant. These expose provider-specific options.
  # Example for VirtualBox:
  #
	config.vm.provider "virtualbox" do |vb|
		# Display the VirtualBox GUI when booting the machine
		#vb.gui = true

		# Customize the amount of memory on the VM:
		#vb.memory = "1024"

		vb.customize ["setextradata", :id, "VBoxInternal2/SharedFoldersEnableSymlinksCreate/htdocs", "1"]
		
		### Change network card to PCnet-FAST III
		# For NAT adapter
		vb.customize ["modifyvm", :id, "--nictype1", "Am79C973"]
		
		# For host-only adapter
		vb.customize ["modifyvm", :id, "--nictype2", "Am79C973"]
	end
  #
  # View the documentation for the provider you are using for more
  # information on available options.

  # Define a Vagrant Push strategy for pushing to Atlas. Other push strategies
  # such as FTP and Heroku are also available. See the documentation at
  # https://docs.vagrantup.com/v2/push/atlas.html for more information.
  # config.push.define "atlas" do |push|
  #   push.app = "YOUR_ATLAS_USERNAME/YOUR_APPLICATION_NAME"
  # end

  # Enable provisioning with a shell script. Additional provisioners such as
  # Puppet, Chef, Ansible, Salt, and Docker are also available. Please see the
  # documentation for more information about their specific syntax and use.
  # config.vm.provision "shell", inline: &lt;&lt;-SHELL
  #   apt-get update
  #   apt-get install -y apache2
  # SHELL
  
  config.vm.boot_timeout = 600
end

</code></pre>
<p><em><strong>Bước 4: Bật m&aacute;y chủ l&ecirc;n</strong></em></p>
<pre><code class="language-vim">$ vagrant up #Đợi v&agrave;i ph&uacute;t m&aacute;y chủ sẽ bật l&ecirc;n

$ vagrant ssh #Login v&agrave;o m&aacute;y chủ bằng SSH
</code></pre>
<p>Sau khi đăng nhập v&agrave;o m&aacute;y chủ, bạn sẽ c&oacute; thể sử dụng giao diện CLI huyền thoại của Ubuntu.&nbsp;</p>
<p>Tiếp theo th&igrave; sao? Th&igrave; c&agrave;i đặt PHP, Apache v&agrave; MySQL v&agrave;o hoặc bất kỳ thứ g&igrave; c&aacute;c bạn cần chứ sao nữa.&nbsp;</p>
<p>Tuy nhi&ecirc;n, b&agrave;i n&agrave;y đến đ&acirc;y l&agrave; kh&aacute; d&agrave;i rồi, l&agrave;m việc với Vagrant như thế n&agrave;o tui sẽ viết ở b&agrave;i viết sau nh&eacute;.</p>
<p>&nbsp;</p>
            ]]>
        </content>
    </entry>
    <entry>
        <title>Kết nối liên tục - persistent connection trong MySQL</title>
        <author>
            <name>@dp0613</name>
        </author>
        <link href="http://devwebwithme.tk/persistence-connection-mysql-1507210971/"/>
        <id>http://devwebwithme.tk/persistence-connection-mysql-1507210971/</id>
            <category term="Kinh nghiệm"/>

        <updated>2017-10-05T20:43:00+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="http://devwebwithme.tk/media/posts/6/system-2660914_1280.jpg" alt="" />
                <p>Đ&acirc;y l&agrave; vấn đề được đề cập đến ở một c&acirc;u hỏi của <a href="https://stackoverflow.com/questions/50303/persistent-db-connections-yea-or-nay" target="_blank" rel="noopener noreferrer">StackOverFlow.com</a>. T&ocirc;i muốn tr&igrave;nh b&agrave;y th&ecirc;m một v&agrave;i quan điểm của m&igrave;nh trong việc sử dụng loại "Kết nối li&ecirc;n tục - persistent connection" trong MySQL.</p>
<h4>Định nghĩa</h4>
<p>Kết nối li&ecirc;n tục đ&uacute;ng như t&ecirc;n gọi của n&oacute;, được giữ diễn ra li&ecirc;n tục, n&oacute; kh&ocirc;ng bị ngắt khi chuỗi truy vấn được thực thi xong. Trước khi thực hiện 1 kết nối li&ecirc;n tục đến m&aacute;y chủ, PHP sẽ kiểm tra xem c&oacute; tồn tại kết nối n&agrave;o được tạo trước đ&oacute; kh&ocirc;ng. Nếu c&oacute; PHP sẽ sử dụng kết nối đ&atilde; tạo đ&oacute;, nếu kh&ocirc;ng th&igrave; mới tiến h&agrave;nh tạo 1 kết nối mới.</p>
<h4>Viết code để mở kết nối li&ecirc;n tục</h4>
<pre><code class="language-php">
&lt;?php 
	//Kết nối th&ocirc;ng qua mysqli
	$conn = mysqli_query('p:localhost', 'root', '', 'my_db_name');
	
	//Kết nối th&ocirc;ng qua PDO
	$conn = new PDO("mysql:host=localhost;dbname=test_ducky", 'root', '', [PDO::ATTR_PERSISTENT =&gt; TRUE]);
?&gt;
</code></pre>
<p>Khi sử dụng <code>mysqli</code>, để mở một kết nối li&ecirc;n tục bạn chỉ cần th&ecirc;m chuỗi <code>p:</code> v&agrave;o đầu <code>hostname</code> l&agrave; được. Với <code>PDO</code> th&igrave; bạn phải set thuộc t&iacute;nh <code>ATTR_PERSISTENT = TRUE</code>.</p>
<h4>Kết nối li&ecirc;n tục gi&uacute;p tăng tốc độ của ứng dụng l&ecirc;n nhiều lần</h4>
<p>Dưới đ&acirc;y l&agrave; đoạn code d&ugrave;ng để so s&aacute;nh tốc độ xử l&yacute; của 2 loại kết nối.</p>
<pre><code class="language-php">
&lt;?php 
	//Biến đo thời gian
	$nonPersistentTime = 0;
	$persistentTime = 0;
	
	
	//Thử kết nối NON-PERSISTENT
	$before = microtime(TRUE);
	for($i = 0; $i &lt; 1000; $i++)
	{
		$conn = mysqli_connect('localhost', 'root', '', 'lab');
		mysqli_set_charset($conn, 'utf8');
		$result = mysqli_query($conn, "SELECT 1;", MYSQLI_USE_RESULT);
		while($row = mysqli_fetch_assoc($result))
		{
			//Kh&ocirc;ng l&agrave;m g&igrave; cả
		}
		mysqli_close($conn);
	}
	$after = microtime(TRUE);
	
	$nonPersistentTime = $after - $before;
	
	//Thử kết nối PERSISTENT
	$before = microtime(TRUE);
	for($i = 0; $i &lt; 1000; $i++)
	{
		$conn = mysqli_connect('p:localhost', 'root', '', 'lab');
		mysqli_set_charset($conn, 'utf8');
		$result = mysqli_query($conn, "SELECT 1;", MYSQLI_USE_RESULT);
		while($row = mysqli_fetch_assoc($result))
		{
			//Kh&ocirc;ng l&agrave;m g&igrave; cả
		}
		mysqli_close($conn);
	}
	$after = microtime(TRUE);
	
	$persistentTime = $after - $before;
	
	//T&iacute;nh to&aacute;n tốc độ ch&ecirc;nh lệch
	$diff = round($nonPersistentTime / $persistentTime, 0);
	
	echo 'Kết nối thường: ', $nonPersistentTime, 'ms. &lt;br /&gt; Kết nối li&ecirc;n tục: ', $persistentTime, 'ms. &lt;br /&gt; Kết nối li&ecirc;n tục nhanh hơn: &lt;b&gt;', $diff, '&lt;/b&gt; lần so với với kết nối thường!';
?&gt;
</code></pre>
<p>&nbsp;V&agrave; đ&acirc;y l&agrave; video ghi lại l&uacute;c chạy thử đoạn code:</p>
<p><iframe width="560" height="315" src="https://www.youtube.com/embed/rcw1HNFVuMY" frameborder="0" allowfullscreen="allowfullscreen"></iframe></p>
<p>Kết nối li&ecirc;n tục gi&uacute;p cho tốc độ xử l&yacute; của ứng dụng tăng l&ecirc;n từ 10 lần.&nbsp;</p>
<p>C&oacute; rất nhiều b&agrave;i viết tr&ecirc;n mạng ph&acirc;n t&iacute;ch về việc sử dụng kết nối li&ecirc;n tục l&agrave; điều xấu, v&agrave; kh&ocirc;ng n&ecirc;n lạm dụng, c&aacute;c bạn c&oacute; thể xem th&ecirc;m ở những link sau:</p>
<p><a href="https://meta.wikimedia.org/wiki/Why_persistent_connections_are_bad">https://meta.wikimedia.org/wiki/Why_persistent_connections_are_bad</a></p>
<p><a href="https://www.percona.com/blog/2006/11/12/are-php-persistent-connections-evil/">https://www.percona.com/blog/2006/11/12/are-php-persistent-connections-evil/</a></p>
<h3>Khi n&agrave;o n&ecirc;n d&ugrave;ng kết nối li&ecirc;n tục</h3>
<p>Thật ra th&igrave; mỗi một chức năng của PHP đều c&oacute; c&ocirc;ng năng ri&ecirc;ng của n&oacute;, kh&ocirc;ng c&oacute; c&aacute;i n&agrave;o l&agrave; ho&agrave;n to&agrave;n xấu cả. Vấn đề nằm ở chỗ lập tr&igrave;nh vi&ecirc;n d&ugrave;ng c&oacute; đ&uacute;ng chỗ, đ&uacute;ng l&uacute;c hay kh&ocirc;ng m&agrave; th&ocirc;i.</p>
<p>Đối với kết nối li&ecirc;n tục, t&ocirc;i xin đưa ra 1 số &yacute; kiến ri&ecirc;ng của m&igrave;nh hi vọng c&aacute;c bạn để lại &yacute; kiến nh&eacute;.</p>
<p><strong>N&Ecirc;N D&Ugrave;NG khi:</strong></p>
<ul>
<li><strong>Ứng dụng của bạn rất thường xuy&ecirc;n gửi request tới m&aacute;y chủ dữ liệu:</strong> web game, ứng dụng thời gian thực...</li>
<li><strong>Bạn sử dụng API để truy xuất dữ liệu từ một m&aacute;y chủ kh&aacute;c:</strong> Bạn n&ecirc;n d&ugrave;ng kết nối li&ecirc;n tục khi thiết kế API loại n&agrave;y.</li>
<li><strong>Chỉ c&oacute; 1 v&agrave;i ứng dụng / người d&ugrave;ng truy cập v&agrave;o m&aacute;y chủ dữ liệu của bạn:&nbsp;</strong>Đối với những website loại nhỏ, vừa, kh&ocirc;ng c&oacute; API mở.</li>
</ul>
<p><strong>KH&Ocirc;NG D&Ugrave;NG khi:</strong></p>
<ul>
<li><strong>Ứng dụng của bạn rất &iacute;t khi gửi request tới m&aacute;y chủ dữ liệu:</strong> V&iacute; dụ như blog, diễn đ&agrave;n, web tin tức...</li>
<li><strong>Bạn c&oacute; nhiều người d&ugrave;ng c&ugrave;ng truy cập chung 1 m&aacute;y chủ dữ liệu:</strong> Chẳng hạn như s&agrave;n thương mại điện tử, shared host, ...</li>
<li><strong>Khi bạn sử dụng Apache ở chế độ Prefork:</strong> Chế độ prefork sử dụng ri&ecirc;ng một kết nối cho một tiến tr&igrave;nh con. Cho n&ecirc;n số lượng kết nối sẽ đột ngột tăng l&ecirc;n rất nhanh khiến cho m&aacute;y chủ qu&aacute; tải.</li>
<li><strong>Hơn nữa, MySQL chỉ cho ph&eacute;p tối đa 1000 kết nối song song</strong>. Cho n&ecirc;n bạn phải ch&uacute; &yacute; t&iacute;nh to&aacute;n số lượng kết nối nếu kh&ocirc;ng muốn m&aacute;y chủ bị qu&aacute; tải.</li>
</ul>
<h4>Kết luận</h4>
<p>B&agrave;i viết n&agrave;y tui đ&atilde; cố gắng tham khảo từ nhiều nguồn v&agrave; tổng hợp lại, ph&acirc;n t&iacute;ch r&otilde; hơn để c&aacute;c bạn c&oacute; thể nắm vững trong 5 - 7 ph&uacute;t đọc b&agrave;i. Hi vọng nhận được &yacute; kiến phản hồi từ c&aacute;c bạn.</p>
<p>&nbsp;</p>
            ]]>
        </content>
    </entry>
    <entry>
        <title>switch case và if else: Liệu bạn có đang dùng búa để đóng tua vít?</title>
        <author>
            <name>@dp0613</name>
        </author>
        <link href="http://devwebwithme.tk/switch-va-if-else-if-lieu-ban-co-dang-dung-bua-dong-tua-vit-1506942139/"/>
        <id>http://devwebwithme.tk/switch-va-if-else-if-lieu-ban-co-dang-dung-bua-dong-tua-vit-1506942139/</id>
            <category term="Kinh nghiệm"/>

        <updated>2017-10-05T20:47:50+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="http://devwebwithme.tk/media/posts/5/confused-880735_1280.jpg" alt="" />
                <p>L&agrave; một lập tr&igrave;nh vi&ecirc;n PHP th&igrave; tui c&oacute; niềm tin rằng bạn biết đến cấu tr&uacute;c <code>switch...case</code> v&agrave; <code>if... else</code>.</p>
<p>Trong b&agrave;i viết n&agrave;y tui sẽ cố gắng ph&acirc;n t&iacute;ch xem khi n&agrave;o th&igrave; ch&uacute;ng ta d&ugrave;ng <code>switch...case</code>, khi n&agrave;o th&igrave; d&ugrave;ng <code>if... else</code>.</p>
<p>Trước ti&ecirc;n, dưới đ&acirc;y l&agrave; đoạn code tui lấy từ blog <a href="http://fluffycat.com" target="_blank" rel="noopener noreferrer">FluffyCat.com</a>, đoạn code n&agrave;y sẽ thử xem trong 100.000 lần lặp th&igrave; liệu <code>switch...case</code> hay <code>if...else&nbsp;</code>nhanh hơn...</p>
<pre><code class="language-php">
&lt;?php
	//copyright Lawrence Truett and FluffyCat.com 2009, all rights reserved
  	define('BR', '&lt;'.'BR'.'&gt;');
	echo 'Performance Testing PHP if / else VS switch with 100,000 iterations'.BR.BR;
	
	$ifTime = 0;
	$switchTime = 0;
	for ($x = 0; $x &lt; 100000; $x++) {
		$oneToFive = rand(1,5);
		if (0 == fmod($x,2)) {
			$switchTime = $switchTime + testSwitch($oneToFive);
			$ifTime = $ifTime + testIf($oneToFive);
		} else {
			$ifTime = $ifTime + testIf($oneToFive);  			
			$switchTime = $switchTime + testSwitch($oneToFive);  		
		}
	}
	echo 'total if / else time: '.$ifTime.BR;
	echo 'total case time: '.$switchTime.BR;
	echo BR;
	if ($ifTime &gt; $switchTime) {
		echo 'switch is quicker by '.($ifTime - $switchTime).BR;
	} else {
		echo 'if / else is quicker by '.($switchTime - $ifTime).BR;		
	}

	function testSwitch($oneToFive) {
		$time_start = microtime(true);
		switch($oneToFive) {
			case 1: $z = 1; break;
			case 2: $z = 2; break;
			case 3: $z = 3; break;
			case 4: $z = 4; break;
			case 5: $z = 5; break;						
		}
		$time_end = microtime(true);
		$time = $time_end - $time_start;
		return $time;
	}
  
	function testIf($oneToFive) {
		$time_start = microtime(true);
		if (1 == $oneToFive) {
			$z = 1;
		} elseif(2 == $oneToFive) {
			$z = 2;			
		} elseif(3 == $oneToFive) {
			$z = 3;	
		} elseif(4 == $oneToFive) {
			$z = 4;	
		} elseif(5 == $oneToFive) {
			$z = 5;	
		}
		$time_end = microtime(true);
		$time = $time_end - $time_start;
		return $time;
	}
?&gt;
</code></pre>
<blockquote>tui đ&atilde; chạy thử v&agrave;i lần v&agrave; kết quả l&agrave; <code>if...else</code> nhanh hơn.</blockquote>
<h4>Tới đ&acirc;y ta kết luận được điều g&igrave;?</h4>
<p>Nếu cấu tr&uacute;c <code>if</code> nhanh hơn th&igrave; PHP lại c&oacute; th&ecirc;m <code>switch</code> để l&agrave;m g&igrave;? Viết code kh&ocirc;ng phải chỉ nh&igrave;n ở tốc độ thực thi, n&oacute; c&ograve;n phụ thuộc v&agrave;o độ sạch v&agrave; dễ hiểu của code. Nếu bạn d&ugrave;ng <code>if</code> v&igrave; nghĩ n&oacute; nhanh th&igrave; đ&ocirc;i l&uacute;c "người đến sau" sẽ bị "thất đi&ecirc;n b&aacute;t đảo", ng&agrave;y đ&ecirc;m mất ngủ v&igrave; bạn (&agrave; nhầm, v&igrave; đống hỗn loạn bạn để lại).</p>
<p>Ch&uacute;ng ta sẽ c&ugrave;ng nhau đi x&eacute;t những v&iacute; dụ v&agrave; r&uacute;t ra kết luận xem khi n&agrave;o d&ugrave;ng <code>switch</code> v&agrave; khi n&agrave;o d&ugrave;ng <code>if</code> nh&eacute;.</p>
<p><strong><em>V&iacute; dụ 1: Sử dụng<code> if</code> hay <code>switch</code> khi c&oacute; từ 2 trường hợp trở l&ecirc;n?</em></strong></p>
<pre><code class="language-php">
&lt;?php 
	switch($a)
	{
		case 1:
			//trường hợp 1
			break;
		case 2:
			//trường hợp 2
			break;
		case 3:
			//trường hợp 3
			break;
		case 4:
			//trường hợp 4
			break;
		default:
			//mặc định
			break;
	}
	
	if($a === 1)
	{
		//trường hợp 1
	} else if($a === 2)
	{
		//trường hợp 2
	} else if($a === 3)
	{
		//trường hợp 3
	} else if($a === 4)
	{
		//trường hợp 4
	} else
	{
		//mặc định
	}
?&gt;
</code></pre>
<p>Bạn thấy g&igrave; chưa? Vẫn c&ograve;n chưa thấy &agrave;? Khi d&ugrave;ng <code>switch</code> th&igrave; calo của bạn sẽ đỡ tốn hơn đấy, c&ograve;n khi d&ugrave;ng <code>if</code> v&agrave; rồi <code>elseif</code> v&agrave; <code>elseif</code> một lần nữa... &ocirc;i! l&uacute;c đ&oacute; tui đảm bảo n&atilde;o của bạn sẽ n&oacute;ng l&ecirc;n. C&oacute; 1 b&iacute; mật của tui m&agrave; rất nhục khi người kh&aacute;c biết l&agrave; tui lu&ocirc;n viết <code>else</code> th&agrave;nh <code>esle</code>, v&agrave; n&atilde;y giờ khi viết b&agrave;i n&agrave;y tui đ&atilde; sửa n&oacute; được mấy lần rồi đ&oacute; :fire: .</p>
<blockquote><strong>Kết luận:</strong> D&ugrave;ng <code>switch</code> khi c&oacute; từ 2 trường hợp trở l&ecirc;n.</blockquote>
<p><em><strong>V&iacute; dụ 2: Khi so s&aacute;nh với gi&aacute; trị trả về từ 1 h&agrave;m n&agrave;o đ&oacute;</strong></em></p>
<pre><code class="language-php">
&lt;?php 
	switch(myFunc())
	{
		case 1:
			//trường hợp 1
			break;
		case 2:
			//trường hợp 2
			break;
		default:
			//mặc định
			break;
	}
	
	if(myFunc() === 1)
	{
		//trường hợp 1
	} else if(myFunc() === 2)
	{
		//trường hợp 2
	} else
	{
		//mặc định
	}
?&gt;
</code></pre>
<p>Nếu so s&aacute;nh như kiểu ở tr&ecirc;n, bạn sẽ dễ d&agrave;ng nhận ra được khi d&ugrave;ng <code>switch</code> th&igrave; h&agrave;m <code>myFunc()</code> chỉ được gọi 1 lần, c&ograve;n khi d&ugrave;ng&nbsp;<code>if</code> l&agrave; <span style="text-decoration: line-through;">mấy tỉ</span> 2 lần.</p>
<blockquote><strong>Kết luận:</strong> D&ugrave;ng <code>switch</code> khi bạn muốn so s&aacute;nh với gi&aacute; trị trả về từ 1 h&agrave;m.</blockquote>
<p><em><strong>&nbsp;V&iacute; dụ 3: Khi điều kiện qu&aacute; phức tạp</strong></em></p>
<pre><code class="language-php">
&lt;?php 
	switch(TRUE)
	{
		case 'bar':
		case 'baz':
		case 'bat':
		case 'buz':
			//l&agrave;m g&igrave; đ&oacute;
			break;
	}
	
	if($foo == 'bar' || $foo == 'baz' || $foo == 'bat' || $foo == 'buz')
	{
		//l&agrave;m g&igrave; đ&oacute;
	}
?&gt;
</code></pre>
<p>&nbsp;Bạn thấy c&aacute;ch n&agrave;o dễ đọc hơn (tui c&oacute; niềm tin l&agrave; bạn hiểu hết cả 2 c&aacute;ch)?</p>
<p>Th&ecirc;m 1 v&iacute; dụ tương tự nh&eacute;:</p>
<pre><code class="language-php">
&lt;?php 

	switch(TRUE)
	{
		case $foo == 'baz' &amp;&amp; $baz == 'foo':
		case $foo == 'foo' &amp;&amp; $baz == 'baz':
			//l&agrave;m g&igrave; đ&oacute;
			break;
	}
	
	if(($foo == 'baz' &amp;&amp; $baz == 'foo') || ($foo == 'foo' &amp;&amp; $baz == 'baz'))
	{
		//l&agrave;m g&igrave; đ&oacute;
	}
?&gt;
</code></pre>
<blockquote><strong>Kết luận:</strong> D&ugrave;ng <code>switch</code> khi điều kiện phức tạp</blockquote>
<h4>&nbsp;Kết luận</h4>
<p>C&aacute;m ơn c&aacute;c bạn đ&atilde; đọc đến đ&acirc;y. Khi code th&igrave; đừng ch&uacute; &yacute; qu&aacute; đến hiệu năng, phải dễ đọc dễ hiểu đ&atilde;. Hi vọng những v&iacute; dụ ở tr&ecirc;n sẽ gi&uacute;p c&aacute;c bạn c&oacute; th&ecirc;m 1 c&aacute;ch nh&igrave;n mới trong nghề "code dạo".&nbsp;</p>
<p>H&atilde;y để lại &yacute; kiến hoặc gi&uacute;p tui t&igrave;m th&ecirc;m v&iacute; dụ nh&eacute;.</p>
            ]]>
        </content>
    </entry>
</feed>
